tap "darrylmorley/whatcable"
tap "derailed/k9s"
tap "lifedever/tap"
tap "ybeapps/sourcegit"
brew "age"
brew "openssl@3"
brew "aria2"
brew "atuin"
brew "bash"
brew "btop"
brew "checkstyle"
brew "chezmoi"
brew "colima", restart_service: :changed
brew "cspell"
brew "ctags"
brew "curl"
brew "dive"
brew "libyaml"
brew "djlint"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "dos2unix"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "libssh"
brew "ffmpegthumbnailer"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "glslang"
brew "gnupg"
brew "go"
brew "goaccess"
brew "hadolint"
brew "pkgconf"
brew "highlight"
brew "himalaya"
brew "imagemagick"
brew "jq"
brew "killport"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "libxml2"
brew "make"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mole"
brew "mongodb-atlas-cli"
brew "tree-sitter"
brew "neovim"
brew "nrm"
brew "nss"
brew "openslide"
brew "opentofu"
brew "pandoc"
brew "pandoc-crossref"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "prettier"
brew "qpdf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruff"
brew "rustscan"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sniffnet"
brew "sqlfluff"
brew "starship"
brew "stylelint"
brew "stylua"
brew "task"
brew "taskwarrior-tui"
brew "texlive"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "uncrustify"
brew "uv"
brew "vim"
brew "vips"
brew "whistle"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "derailed/k9s/k9s"
cask "adrive"
cask "alacritty"
cask "betterdisplay"
cask "blender"
cask "calibre"
cask "cursor"
cask "dbgate"
cask "dorso"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "httpie-desktop"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "localsend"
cask "losslesscut"
cask "lulu"
cask "maccy"
cask "macfuse"
cask "macpass"
cask "mark-text"
cask "meld"
cask "obsidian"
cask "ollama-app"
cask "openinterminal-lite"
cask "openvpn-connect"
cask "qianwen"
cask "qq"
cask "rectangle"
cask "shottr"
cask "sioyek"
cask "ybeapps/sourcegit/sourcegit"
cask "syncthing-app"
cask "tailscale-app"
cask "telegram-desktop"
cask "thor"
cask "utm"
cask "visual-studio-code"
cask "wechat"
cask "wechatwork"
cask "wezterm"
cask "whatcable"
cask "wpsoffice-cn"
cask "youdaonote"
