# Arch Linux official repository packages
# Base tools
p7zip
btop
curl
distrobox
docker
docker-buildx
docker-compose
e2fsprogs
fd
fio
fzf
gcc
github-cli
git
git-lfs
gitlint
gnupg
goaccess
hdparm
highlight
httpie
hwinfo
imagemagick
jq
nss
libvips
libxml2
openssl
pandoc
python-jedi
qpdf
ripgrep
samba
shellcheck
shfmt
sqlfluff
the_silver_searcher
smartmontools
strace
stress
syncthing
timeshift
tmux
uncrustify
ctags
vim
yamllint
zoxide
zsh

# Desktop applications
blender
calibre
clamav
copyq
filezilla
flameshot
gimp
keepassxc
meld
mousepad
mpv
qbittorrent
remmina
thunderbird

# Input method
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-table-extra

# Media
ffmpeg
ffmpegthumbnailer

# Network
networkmanager

# Sway and Wayland
blueman
brightnessctl
cliphist
foot
grim
gammastep
kanshi
mako
rofi
wofi
slurp
sway
swaybg
swayidle
swayimg
swappy
waybar
wl-clipboard
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
thunar
tlp
pavucontrol
wf-recorder
imv
pipewire
